latex/structure/paragraphs.org
#+title: paragraphs
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil

* don't indent

#+BEGIN_SRC tex
  \noindent
#+END_SRC

* don't indent, increase seperation

#+BEGIN_SRC tex
  \usepackage{parskip}

  % Make paragraphs not indented at the first line, but spaced apart
  % slightly:

  % \setlength{\parindent}{0mm}
  % \setlength{\parskip}{\medskipamount}
#+END_SRC

* line spacing

#+BEGIN_SRC tex
  % this command sets the spacing between lines.  2.0 is double spacing,
  % default is?

  \renewcommand{\baselinestretch}{1.3}
#+END_SRC

* variables

#+BEGIN_SRC tex
  %\setlength{\parskip}{0pt}
  %\setlength{\parsep}{2pt}
#+END_SRC

* NOTES
- default is to justify the first paragraph and indent the rest.
- adjust
  - spacing between paragraphs
  - indenting the first line

[[file:../latex.html][back]]
